Revit 2027 API
ParameterTypeId.SteelElemHoleDepth Property
 "Hole Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemHoleDepth { get; }
Public Shared ReadOnly Property SteelElemHoleDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemHoleDepth {
	ForgeTypeId^ get ();
}
static member SteelElemHoleDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace